#Попросить пользователя ввести возраст.
#По возрасту определить, чем он должен заниматься: учиться в детском саду, школе, ВУЗе или работать.
#Вывести занятие на экран.

age = int(input('Введите ваш возраст: '))

if age < 7:
	print('Вы посещаете детский сад.')

elif age <= 18:
	print('Вы учитесь в школе.')

elif age <= 24: 
	print('Скорее всего, вы учитесь в ВУЗе.')

elif age < 60:
	print('А ну пошел на работку')

else:
	print('Братан, расслабься, выпей пивка')